Revit 2027 API
SpecTypeId.Rotation Property
 Rotation, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Rotation { get; }
Public Shared ReadOnly Property Rotation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Rotation {
	ForgeTypeId^ get ();
}
static member Rotation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace